---
kind: type
id: T:Autodesk.Revit.DB.Events.ExternalDataInstanceRemovedFromDocumentEventArgs
source: html/471c4688-8595-9ef9-db74-eccd12ae44a4.htm
---
# Autodesk.Revit.DB.Events.ExternalDataInstanceRemovedFromDocumentEventArgs

The event arguments used by the ExternalDataInstanceRemovedFrom event.

## Syntax (C#)
```csharp
public class ExternalDataInstanceRemovedFromDocumentEventArgs : RevitAPIPostDocEventArgs
```